leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5567_portdefs.h
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_OTHER_P PORT_FUNC1
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_OTHER_P PORT_FUNC1
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_OTHER_P PORT_FUNC1
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_OTHER_P PORT_FUNC1
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_OTHER_P PORT_FUNC1
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_OTHER_A PORT_FUNC2
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_FLEXRAY PORT_FUNC4
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_OTHER_P PORT_FUNC1
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_OTHER_A PORT_FUNC2
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_FLEXRAY PORT_FUNC4
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_136_PORT_PIN_MODE_OTHER_P PORT_FUNC1
#define PIN_FUNCTION_REG_136_PORT_PIN_MODE_OTHER_A PORT_FUNC2
#define PIN_FUNCTION_REG_136_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_137_PORT_PIN_MODE_OTHER_P PORT_FUNC1
#define PIN_FUNCTION_REG_137_PORT_PIN_MODE_OTHER_A PORT_FUNC2
#define PIN_FUNCTION_REG_137_PORT_PIN_MODE_FLEXRAY PORT_FUNC4
#define PIN_FUNCTION_REG_137_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_138_PORT_PIN_MODE_OTHER_A PORT_FUNC2
#define PIN_FUNCTION_REG_138_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_OTHER_A PORT_FUNC2
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_OTHER_A PORT_FUNC2
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_OTHER_A PORT_FUNC2
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_142_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_142_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_OTHER_P PORT_FUNC1
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_OTHER_P PORT_FUNC1
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_179_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_179_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_180_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_180_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_181_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_181_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_182_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_182_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_183_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_183_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_184_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_184_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_185_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_185_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_186_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_186_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_187_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_187_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_188_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_188_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_189_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_189_PORT_PIN_MODE_OTHER_A PORT_FUNC2
#define PIN_FUNCTION_REG_189_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_190_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_190_PORT_PIN_MODE_OTHER_A PORT_FUNC2
#define PIN_FUNCTION_REG_190_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_191_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_191_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_192_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_192_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_193_PORT_PIN_MODE_OTHER_A PORT_FUNC2
#define PIN_FUNCTION_REG_193_PORT_PIN_MODE_CAN PORT_FUNC4
#define PIN_FUNCTION_REG_193_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_194_PORT_PIN_MODE_OTHER_A PORT_FUNC2
#define PIN_FUNCTION_REG_194_PORT_PIN_MODE_CAN PORT_FUNC4
#define PIN_FUNCTION_REG_194_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_195_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_195_PORT_PIN_MODE_FLEXRAY PORT_FUNC4
#define PIN_FUNCTION_REG_195_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_196_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_196_PORT_PIN_MODE_FLEXRAY PORT_FUNC4
#define PIN_FUNCTION_REG_196_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_197_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_197_PORT_PIN_MODE_FLEXRAY PORT_FUNC4
#define PIN_FUNCTION_REG_197_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_198_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_198_PORT_PIN_MODE_FLEXRAY PORT_FUNC4
#define PIN_FUNCTION_REG_198_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_199_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_199_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_200_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_200_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_201_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_201_PORT_PIN_MODE_CAN PORT_FUNC4
#define PIN_FUNCTION_REG_201_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_202_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_202_PORT_PIN_MODE_CAN PORT_FUNC4
#define PIN_FUNCTION_REG_202_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_203_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_203_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_204_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_204_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_205_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_206_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_207_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_229_PORT_PIN_MODE_OTHER_P PORT_FUNC1
#define PIN_FUNCTION_REG_214_PORT_PIN_MODE_OTHER_P PORT_FUNC1
#define PIN_FUNCTION_REG_179_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_180_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_181_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_182_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_183_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_184_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_185_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_186_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_187_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_188_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_189_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_190_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_195_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_196_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_197_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_198_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_199_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_200_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_201_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_202_PORT_PIN_MODE_ICU PORT_FUNC1

#endif  /* _MPC5567PORTS_H */
